{"class_name": "Sequential", "optimizer": {"epsilon": 1e-08, "rho": 0.8999999761581421, "lr": 0.004999999888241291, "name": "RMSprop"}, "config": [{"class_name": "Dense", "config": {"input_dtype": "float32", "bias": true, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "init": "uniform", "output_dim": 30, "b_constraint": null, "batch_input_shape": [null, 2], "trainable": true, "input_dim": 2, "activation": "linear", "name": "dense_1"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dense", "config": {"bias": true, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "init": "uniform", "output_dim": 30, "b_constraint": null, "trainable": true, "input_dim": null, "activation": "linear", "name": "dense_2"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Dense", "config": {"bias": true, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "init": "uniform", "output_dim": 20, "b_constraint": null, "trainable": true, "input_dim": null, "activation": "linear", "name": "dense_3"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dense", "config": {"bias": true, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "init": "uniform", "output_dim": 1, "b_constraint": null, "trainable": true, "input_dim": null, "activation": "linear", "name": "dense_4"}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_4"}}], "sample_weight_mode": null, "keras_version": "1.0.4", "loss": "mse"}